//Задача 1: Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
Console.WriteLine("Введите число");
int n1 = Convert.ToInt32 (Console.ReadLine());
int n2 = 161;


if (n1%n2 == 0)
{
Console.WriteLine("yes");
}

else 

{
Console.WriteLine("no");
}

    

    
